Revit 2015 API
BooleanOperationsUtils.ExecuteBooleanOperationModifyingOriginalSolid Method
 Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
public static void ExecuteBooleanOperationModifyingOriginalSolid(
	Solid solid0,
	Solid solid1,
	BooleanOperationsType booleanType
)
Visual Basic
Public Shared Sub ExecuteBooleanOperationModifyingOriginalSolid ( _
	solid0 As Solid, _
	solid1 As Solid, _
	booleanType As BooleanOperationsType _
)
Visual C++
public:
static void ExecuteBooleanOperationModifyingOriginalSolid(
	Solid^ solid0,
	Solid^ solid1,
	BooleanOperationsType booleanType
)
Parameters
solid0
Type: Autodesk.Revit.DB.Solid
 The original solid object. This object cannot be obtained directly from a Revit element. This means that IsElementGeometry cannot be true.
solid1
Type: Autodesk.Revit.DB.Solid
 The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType
Type: Autodesk.Revit.DB.BooleanOperationsType
 boolean operation type.
Remarks
 This operation modifies the original input Geometry objects.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the original solid object is the geometry of Revit model.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  Failed to perform the boolean operation for the two solids.
See Also
BooleanOperationsUtils Class
Autodesk.Revit.DB Namespace